# Updating rows and columns

## 1) Updating dataset's columns

In [6]:
import pandas as pd

people={
    "first":["Ali","Sami","Waleed","Sameh"],
    "last":["Magdy","Marwan","Mansour","Ahmed"],
    "email":["ali@magdy.com","sami@Marwan.com","waleed@mansour.com","sameh@ahmed.com"],
    "salary":[2000,1500,900,1200]
}

p_df=pd.DataFrame(people)
p_df.columns

Index(['first', 'last', 'email', 'salary'], dtype='object')

To Rename the columns you can assign them to the columns attribute of your data frame

In [9]:
p_df.columns=['first name','last name','email','salary']

p_df.columns
p_df

  first name last name               email  salary
0        Ali     Magdy       ali@magdy.com    2000
1       Sami    Marwan     sami@Marwan.com    1500
2     Waleed   Mansour  waleed@mansour.com     900
3      Sameh     Ahmed     sameh@ahmed.com    1200

it works but if I use the dot way to access a column which contins white spaces it won't work correctly

```python
p_df.first name
# it will give me a syntax error 
```

 so the solution that  I will replace these white space with underscore  `_`

In [12]:
p_df.columns=p_df.columns.str.replace(' ','_')
p_df

  first_name last_name               email  salary
0        Ali     Magdy       ali@magdy.com    2000
1       Sami    Marwan     sami@Marwan.com    1500
2     Waleed   Mansour  waleed@mansour.com     900
3      Sameh     Ahmed     sameh@ahmed.com    1200

I want to cpitalize the first character for each  column name names

In [15]:
p_df.columns=[x.capitalize() for x in p_df.columns]
p_df

  First_name Last_name               Email  Salary
0        Ali     Magdy       ali@magdy.com    2000
1       Sami    Marwan     sami@Marwan.com    1500
2     Waleed   Mansour  waleed@mansour.com     900
3      Sameh     Ahmed     sameh@ahmed.com    1200

I want to restore the default of the names for a specific modified columns 
- First_name =>first
- Last_name => last

The solution is to pass the columns as a dictionary using data frame `rename()` method  : 
```python
columns={
    "Current_col_name":"new name"
}
```

In [18]:
p_df.rename(columns={"First_name":"first","Last_name":"last"},inplace=True)
p_df

    first     last               Email  Salary
0     Ali    Magdy       ali@magdy.com    2000
1    Sami   Marwan     sami@Marwan.com    1500
2  Waleed  Mansour  waleed@mansour.com     900
3   Sameh    Ahmed     sameh@ahmed.com    1200

---

## 2) Updating data for row

I want to replace the last row of this people data set with these attributes
```python
{
    "first":'x',
    "last":'y',
    "Email":'x@y.com',
    "Salary":1000
}
``` 

To do this I can use `loc` or `iloc` and passing a filter or the index number to fetch this row's data

In [25]:
p_df.loc[3]=['x','y','x@y.com',1000]
p_df

    first     last               Email  Salary
0     Ali    Magdy       ali@magdy.com    2000
1    Sami   Marwan     sami@Marwan.com    1500
2  Waleed  Mansour  waleed@mansour.com     900
3       x        y             x@y.com    1000

but it will be hard every time I want to change a specific value I will pass the whole data to be assigned as you can see in the previous example 

what I should do if I want to increase its salary to be 2000 without change or assign values of other attributes ?

```diff
+ solution is to 
speicify the column which you want to change its value 
```

In [26]:
p_df.loc[3,['Salary']]=[2000]
p_df

    first     last               Email  Salary
0     Ali    Magdy       ali@magdy.com    2000
1    Sami   Marwan     sami@Marwan.com    1500
2  Waleed  Mansour  waleed@mansour.com     900
3       x        y             x@y.com    2000

---
Common error you should be careful with it :

In [28]:
fltr=p_df['Email']=='waleed@mansour.com'
p_df[fltr]['last']="XXXXX"

/tmp/ipykernel_8614/1458497284.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  p_df[fltr]['last']="XXXXX"

As You can seet the warnning messege 

`A value is trying to be set on a copy of a slice from a DataFrame`

because it but our changes in temp variables befor apply it to the original data frame so it can not detrmine what it should do and advice you to use `loc` as alternative

In [30]:
# The best practise is 
p_df.loc[fltr,['last']] = "XXXXX"
p_df

    first    last               Email  Salary
0     Ali   Magdy       ali@magdy.com    2000
1    Sami  Marwan     sami@Marwan.com    1500
2  Waleed   XXXXX  waleed@mansour.com     900
3       x       y             x@y.com    2000

----

### How To do changes on multiple rows of data

In [37]:
# First I will make all emails characters is upper case by using column

p_df['Email'] = p_df['Email'].str.upper()
p_df

    first    last               Email  Salary
0     Ali   Magdy       ALI@MAGDY.COM    2000
1    Sami  Marwan     SAMI@MARWAN.COM    1500
2  Waleed   XXXXX  WALEED@MANSOUR.COM     900
3       x       y             X@Y.COM    2000

there are some data frame functions that help me to do changes on the data frame :
1) apply
    - I can use it to grap some info about data or do some changes on it
2) map
3) applymap
4)  replace

#### 1)apply

In [33]:
#  grapping information =>
# give me the length of each email on my data set 

p_df['Email'].apply(len)

0    13
1    15
2    18
3     7
Name: Email, dtype: int64

In [39]:
#  do changes =>
# rollback the emails to lower case 

# I can use lambda function

p_df['Email'] = p_df['Email'].apply(lambda x : ( x + "" ).capitalize())

# or predefined function but without passing its params in call

def cap_mail(x):
    return ( x + "" ).capitalize()
p_df['Email'] = p_df['Email'].apply(cap_mail)

p_df

    first    last               Email  Salary
0     Ali   Magdy       Ali@magdy.com    2000
1    Sami  Marwan     Sami@marwan.com    1500
2  Waleed   XXXXX  Waleed@mansour.com     900
3       x       y             X@y.com    2000